In [1]:
print("Rudra Upadhyay")

Rudra Upadhyay

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
s = pd.Series([2,-4,6,3, None], index=['A','B','C','D','E'])

In [12]:
data = {'RollNo' : [101,102,75,99],
       'Name' : ['Mithlesh', 'Ram', 'Rudra', 'Mithlesh'],
       'Course' : ['Python', 'Data Science', 'Machine Learning', 'statistics']}

In [13]:
df = pd.DataFrame(data, columns=['RollNo', 'Name', 'Course'])

In [14]:
s['D']

3.0

In [15]:
s['A':'C']

A    2.0
B   -4.0
C    6.0
dtype: float64

In [16]:
s[:'C']

A    2.0
B   -4.0
C    6.0
dtype: float64

In [17]:
s['B':]

B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [18]:
s[(s>0)]

A    2.0
C    6.0
D    3.0
dtype: float64

In [19]:
s[(s<0)]

B   -4.0
dtype: float64

In [21]:
s[(s<-2) | ~(s>1)]

B   -4.0
E    NaN
dtype: float64

In [22]:
df['Name']

0    Mithlesh
1         Ram
2       Rudra
3    Mithlesh
Name: Name, dtype: object

In [23]:
df[:1]

   RollNo      Name  Course
0     101  Mithlesh  Python

In [24]:
df

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [25]:
df.columns

Index(['RollNo', 'Name', 'Course'], dtype='object')

In [29]:
df.describe

<bound method NDFrame.describe of    RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics>

In [30]:
df.head

<bound method NDFrame.head of    RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics>

In [31]:
df.head(2)

   RollNo      Name        Course
0     101  Mithlesh        Python
1     102       Ram  Data Science

In [32]:
df.head(5)

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [33]:
df[1:]

   RollNo      Name            Course
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [35]:
df[1:3]

   RollNo   Name            Course
1     102    Ram      Data Science
2      75  Rudra  Machine Learning

In [39]:
df.loc[[2],['Name']]

    Name
2  Rudra

In [41]:
df.iat[1,2]

'Data Science'

In [42]:
df.iloc[1,2]

'Data Science'

In [46]:
df.loc[[2],['Name']]

    Name
2  Rudra

In [48]:
df.columns

Index(['RollNo', 'Name', 'Course'], dtype='object')

In [50]:
df.columns = ['a', 'b', 'c']

In [51]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [53]:
df = df.rename(columns={'RollNo':'ID', 'Name':'Student_Name'})

In [56]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [58]:
df

     a         b                 c
0  101  Mithlesh            Python
1  102       Ram      Data Science
2   75     Rudra  Machine Learning
3   99  Mithlesh        statistics

In [59]:
df.rename(columns={'RollNo':'ID', 'Name':'Student_Name'}, inplace=True)

In [60]:
df

     a         b                 c
0  101  Mithlesh            Python
1  102       Ram      Data Science
2   75     Rudra  Machine Learning
3   99  Mithlesh        statistics

In [61]:
s

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [62]:
s1 = s

In [63]:
s1

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [64]:
s_copy = s.copy()

In [65]:
s_copy

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [66]:
s

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [67]:
df1 = s

In [68]:
df1

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [69]:
df_copy = df.copy()

In [70]:
df_copy

     a         b                 c
0  101  Mithlesh            Python
1  102       Ram      Data Science
2   75     Rudra  Machine Learning
3   99  Mithlesh        statistics

In [71]:
s.astype(float)

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [78]:
print(df.columns)
print(df.head())

Index(['a', 'b', 'c'], dtype='object')
     a         b                 c
0  101  Mithlesh            Python
1  102       Ram      Data Science
2   75     Rudra  Machine Learning
3   99  Mithlesh        statistics

In [84]:
df = df.rename(columns={'a': 'RollNo', 'b':'Name', 'c':'Course'})

In [85]:
df

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [86]:
duplicates = df[df.duplicated(subset='Name')]

In [88]:
duplicates

   RollNo      Name      Course
3      99  Mithlesh  statistics

In [89]:
df.drop_duplicates(subset={'Name'})

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning

In [91]:
df.drop_duplicates(subset=['Name'], keep='last')

   RollNo      Name            Course
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [93]:
s.replace(6, 'Six')

A    2.0
B   -4.0
C    Six
D    3.0
E    NaN
dtype: object

In [95]:
s.replace([2,6],['Two', 'Six'])

A    Two
B   -4.0
C    Six
D    3.0
E    NaN
dtype: object

In [96]:
s.drop(['B','D'])

A    2.0
C    6.0
E    NaN
dtype: float64

In [97]:
df.drop('Name', axis=1)

   RollNo            Course
0     101            Python
1     102      Data Science
2      75  Machine Learning
3      99        statistics

In [99]:
s.isnull()

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [100]:
s.notnull()

A     True
B     True
C     True
D     True
E    False
dtype: bool

In [101]:
df.isnull()

   RollNo   Name  Course
0   False  False   False
1   False  False   False
2   False  False   False
3   False  False   False

In [102]:
df.notnull()

   RollNo  Name  Course
0    True  True    True
1    True  True    True
2    True  True    True
3    True  True    True

In [103]:
df.dropna()

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [104]:
df.dropna(axis=1)

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [105]:
df.dropna(axis=1)

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [106]:
df.fillna('Nothing')

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [107]:
s.fillna('Nothing')

A        2.0
B       -4.0
C        6.0
D        3.0
E    Nothing
dtype: object

In [108]:
s.fillna('mean')

A     2.0
B    -4.0
C     6.0
D     3.0
E    mean
dtype: object

In [112]:
s.fillna('NAN')

A    2.0
B   -4.0
C    6.0
D    3.0
E    NAN
dtype: object

In [113]:
s.fillna(s.mean())

A    2.00
B   -4.00
C    6.00
D    3.00
E    1.75
dtype: float64

In [115]:
s.fillna(s.median())

A    2.0
B   -4.0
C    6.0
D    3.0
E    2.5
dtype: float64

In [117]:
s.fillna(s.mode())

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [118]:
df.sort_index()

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [121]:
df.sort_values(by='Name')

   RollNo      Name            Course
0     101  Mithlesh            Python
3      99  Mithlesh        statistics
1     102       Ram      Data Science
2      75     Rudra  Machine Learning

In [122]:
df.rank()

   RollNo  Name  Course
0     3.0   1.5     3.0
1     4.0   3.0     1.0
2     1.0   4.0     2.0
3     2.0   1.5     4.0

In [123]:
len(s)

5

In [124]:
len(df)

4

In [125]:
df.shape

(4, 3)

In [126]:
s.shape

(5,)

In [127]:
s.head()

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [128]:
df.head()

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [129]:
s.head

<bound method NDFrame.head of A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64>

In [130]:
s.head()

A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64

In [131]:
df

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [132]:
df.shape

(4, 3)

In [133]:
df.describe

<bound method NDFrame.describe of    RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics>

In [134]:
df.describe()

           RollNo
count    4.000000
mean    94.250000
std     12.893797
min     75.000000
25%     93.000000
50%    100.000000
75%    101.250000
max    102.000000

In [135]:
s.describe

<bound method NDFrame.describe of A    2.0
B   -4.0
C    6.0
D    3.0
E    NaN
dtype: float64>

In [136]:
s.describe()

count    4.000000
mean     1.750000
std      4.193249
min     -4.000000
25%      0.500000
50%      2.500000
75%      3.750000
max      6.000000
dtype: float64

In [137]:
df.head()

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [138]:
df.head(5)

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [139]:
df.tail()

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [140]:
df.tail(3)

   RollNo      Name            Course
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics

In [141]:
df.head(3)

   RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning

In [142]:
df.count()

RollNo    4
Name      4
Course    4
dtype: int64

In [143]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [145]:
df.columns

Index(['RollNo', 'Name', 'Course'], dtype='object')

In [146]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  4 non-null      int64
 1   Name    4 non-null      object
 2   Course  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [147]:
df.info

<bound method DataFrame.info of    RollNo      Name            Course
0     101  Mithlesh            Python
1     102       Ram      Data Science
2      75     Rudra  Machine Learning
3      99  Mithlesh        statistics>

In [148]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  4 non-null      int64
 1   Name    4 non-null      object
 2   Course  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [149]:
df.dtypes

RollNo     int64
Name      object
Course    object
dtype: object

In [150]:
df.describe()

           RollNo
count    4.000000
mean    94.250000
std     12.893797
min     75.000000
25%     93.000000
50%    100.000000
75%    101.250000
max    102.000000

In [154]:
f = lambda x : x*2

In [155]:
s.apply(f)

A     4.0
B    -8.0
C    12.0
D     6.0
E     NaN
dtype: float64

In [156]:
df.apply(f)

   RollNo              Name                            Course
0     202  MithleshMithlesh                      PythonPython
1     204            RamRam          Data ScienceData Science
2     150        RudraRudra  Machine LearningMachine Learning
3     198  MithleshMithlesh              statisticsstatistics

In [159]:
s2 = pd.Series([8,-1,4],index=['A','B','D'])

In [160]:
s+s2

A    10.0
B    -5.0
C     NaN
D     7.0
E     NaN
dtype: float64

In [161]:
s2

A    8
B   -1
D    4
dtype: int64

In [162]:
s.add(s2, fill_value=0)

A    10.0
B    -5.0
C     6.0
D     7.0
E     NaN
dtype: float64